bkup_BS_JG_pitzDaily/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    courseFace
    {
        type            zeroGradient;
    }
    courseCyclicBoundary
    {
        type            cyclicAMI;
    }
    courseWalls
    {
        type            zeroGradient;
    }
    freeBoundaryCourse
    {
        type            fixedValue;
        value           uniform 0;
    }
    courseSymmetryWalls
    {
        type            symmetryPlane;
    }
    fineSymmetryWall
    {
        type            symmetryPlane;
    }
    fineWalls
    {
        type            zeroGradient;
    }
    fineCyclicBoundary
    {
        type            cyclicAMI;
    }
    fineplug
    {
        type            cyclicAMI;
    }
    faceFine
    {
        type            zeroGradient;
    }
    inletFace
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    inletWalls
    {
        type            zeroGradient;
    }
    outletInlet
    {
        type            cyclicAMI;
    }
}

// ************************************************************************* //
